package home_work_5.generators;

import java.util.Random;

public class AnimalDataGenerator extends PersonDataGenerator {
    private final String[] listName = new String[] {"Абрис", "Агат", "Арчи", "Алекс", "Амур", "Алтaй", "Альф", "Алмаз",
            "Атос", "Амиго", "Аксель", "Ангел", "Адам", "Арнольд", "Август", "Арон", "Акс", "Альт", "Алвен", "Арго",
            "Арно", "Арес", "Атаман", "Арс", "Айран", "Антей", "Анри", "Анре", "Аполло", "Арамис", "Азор", "Апельсин",
            "Азарт", "Аркан", "Аскольд", "Артос", "Аццо", "Бах", "Баффи", "Бамби", "Багги", "Бенни", "Бенджи", "Бо",
            "Барон", "Бутч", "Боня", "Бим", "Бадди", "Барни", "Балу", "Барс", "Балто", "Бэрти", "Бакс", "Байкал",
            "Буран", "Босс", "Блэк", "Бой", "Бублик", "Бруно", "Бумер", "Бек", "Барри", "Бен", "Бакстер", "Блэйк",
            "Борман", "Беня", "Блэйд", "Бонд", "Бантик", "Бостон", "Бинго", "Билли", "Бобби", "Брюс", "Вебер", "Вейдер",
            "Вольт", "Вальтер", "Виспер", "Веня", "Вольф", "Вулкан", "Вегас", "Ватсон", "Вайс", "Вилли", "Винни",
            "Валли", "Волк", "Валет", "Вайт", "Вульф", "Вуди", "Вайк", "Волчок", "Вжик", "Вилл", "Винтик", "Варг",
            "Вест", "Вито", "Вурст", "Витязь", "Верон", "Вэл", "Густав", "Гантер", "Ганди", "Гром", "Граф", "Гизмо",
            "Грэй", "Гектор", "Гуччи", "Ганс", "Гай", "Голд", "Гилмор", "Гарри", "Гранд", "Гуфи", "Герцог", "Гермес"};
    @Override
    public String nameGenerator() {
        Random rnd = new Random();
        int element = rnd.nextInt(listName.length + 1);
        return listName[element];
    }
    public String ageGenerator() {
        Random rnd = new Random();
        int age = (1 + rnd.nextInt(16));
        return Integer.toString(age);
    }
}
